/*******************************************************************************
* タイトル:		エンジンプログラム
* プログラム名:	Engine.h
* 作成者:		Sand639/大槻　海斗	(https://github.com/Sand639)
* 作成日:		2025/07/26
* 説明:		    エンジンのイベント関数を定義するクラス
********************************************************************************/
#pragma once

/*******************************************************************************
 クラス名:	Engine
 説明　:	エンジンのイベント関数を定義するクラス
*******************************************************************************/
class Engine {
public:
    static bool Initialize();   // 初期化処理
    static void Update();       // 更新処理
	static void Draw();         // 描画処理
    static bool Finalize();     // 終了処理
};